In [36]:
import pandas as pd

In [11]:
match=pd.read_excel('match.xlsx')
source=match.reindex(columns=['source','type1'])
source

                        source    type1
0           bu./course/college   string
1           bu./course/college   string
2           bu./course/college   string
3           bu./course/college   string
4           bu./course/college   string
...                        ...      ...
997   fsu./Course/Section/#agg  integer
998   fsu./Course/Section/#agg  integer
999   fsu./Course/Section/#agg  integer
1000  fsu./Course/Section/#agg  integer
1001  fsu./Course/Section/#agg  integer

[1002 rows x 2 columns]

In [19]:
source=source.drop_duplicates()

source=source.rename(columns={'source':'column','type1':'type'})
source

                                  column     type
0                     bu./course/college   string
5            bu./course/courseInfo/@code   string
10      bu./course/courseInfo/instructor   string
15   bu./course/courseInfo/schedule/days     date
20   bu./course/courseInfo/schedule/room   string
..                                   ...      ...
977    fsu./Course/Detail/SeatsOpen/#agg  integer
982             fsu./Course/Detail/Title   string
987              fsu./Course/ReferenceNo   string
992                  fsu./Course/Section  integer
997             fsu./Course/Section/#agg  integer

[123 rows x 2 columns]

In [20]:
target=match.reindex(columns=['target','type2'])
target=target.drop_duplicates()
target=target.rename(columns={'target':'column','type2':'type'})
target

                          column    type
0          arizona./Course/@Code  string
1            arizona./Course/Day    date
2     arizona./Course/Instructor  string
3          arizona./Course/Place  string
4           arizona./Course/Time    time
..                           ...     ...
863  stanford./Course/CourseCode  string
864  stanford./Course/CourseName  string
865     stanford./Course/DayTime    time
866  stanford./Course/Instructor  string
867        stanford./Course/Room  string

[90 rows x 2 columns]

In [15]:
len(target[target['type2']=='string'])+len(source[source['type1']=='string'])

149

In [16]:
90+123

213

In [17]:
149/213

0.6995305164319249

In [24]:
fin=pd.concat([source,target]).drop_duplicates()

In [25]:
len(fin[fin['type']=='string'])/167

0.7005988023952096

In [27]:
(len(fin[fin['type']=='date'])+len(fin[fin['type']=='time']))/167

0.1437125748502994

In [28]:
(len(fin[fin['type']=='integer']))/167

0.15568862275449102

In [33]:
pd.set_option('display.max_rows',200)
len(fin)

167

In [35]:
sum(match['label'])

52

In [39]:
test=pd.read_excel('seen_split/test_thalia.xlsx')
train=pd.read_excel('seen_split/train_thalia.xlsx')
val=pd.read_excel('seen_split/val_thalia.xlsx')

In [40]:
thalia=pd.concat([train,val,test])
thalia

,source,target,des1,des2,label
0,washu./Course/Title,umich./course/prerequisite,washu. Course Title,umich. course prerequisite,0
1,nyu./Course/Days,gatech./Course/Code,nyu. Course Days,gatech. Course Code,0
2,umich./course/@subject,fiu./Course/Prereq,umich. course @subject,fiu. Course Prereq,0
3,hku./Course/CourseSite,harvard./Course/Prereqs,hku. Course CourseSite,harvard. Course Prereqs,0
4,yale./Course/Instructor,gatech./Course/In/#agg,yale. Course Instructor,gatech. Course In #agg,0
...,...,...,...,...,...
127,washu./Course/Instructor,fiu./Course/Prereq,washu. Course Instructor,fiu. Course Prereq,0
128,nyu./Course/Days,gatech./Course/Description,nyu. Course Days,gatech. Course Description,0
129,yale./Course/Instructor,gatech./Course/Code/#agg,yale. Course Instructor,gatech. Course Code #agg,0
130,toronto./course/coursewebsite,metu./Course/@Code,toronto. course coursewebsite,metu. Course @Code,0
131,uiuc./BannerNumber/UIDirectNumber,hku./Course/CourseSite,uiuc. BannerNumber UIDirectNumber,hku. Course CourseSite,0

In [41]:
des1_mean=(thalia['des1'].str.len().mean()+thalia['des2'].str.len().mean())/2
des1_min=min(thalia['des1'].str.len().min(),thalia['des2'].str.len().min())
des1_max=max(thalia['des1'].str.len().max(),thalia['des2'].str.len().max())

In [42]:
des1_mean

22.4560878243513

In [43]:
des1_min

14

In [44]:
des1_max

35